packages/test/src/utilities/diagrams/test-diagram-expected.puml
@startuml
hide empty members

' qualified name: "test"


annotation Annotation1
Annotation1 ..# Node : <i>annotates</i>

annotation Annotation2 extends Annotation1 implements Interface1

class Concept1 {
  prop1: CustomPrimitive?
}

class "CustomPrimitive" <<primitive type>>
interface Interface1


' relations:



Concept1 "*" --> "*" Concept1: selfRefs
Concept1 "*" --> "1" Node: nodeTargets



@enduml
